china-djyos/djyos/bsp/cpudrv/stm32/L4/src/uart/cpu_peri_uart.c
// =============================================================================
typedef struct
{
    char* Name;
    tagUartReg volatile *Reg;
    u8 TxRxIntLine;
    u8 DmaRxIntLine;
    u8 DmaTxIntLine;
    u8 DmaReq;
    DMA_Channel_TypeDef *DmaRxCh;
    DMA_Channel_TypeDef *DmaTxCh;
}tagUartCfg;

static const tagUartCfg sUartCfg[CN_UART_NUM] = {
{"UART1",(tagUartReg volatile *)USART1_BASE,CN_INT_LINE_USART1,CN_INT_LINE_DMA1_CH5,CN_INT_LINE_DMA1_CH4,DMA_REQUEST_2,DMA1_Channel5,DMA1_Channel4},
{"UART2",(tagUartReg volatile *)USART2_BASE,CN_INT_LINE_USART2,CN_INT_LINE_DMA1_CH6,CN_INT_LINE_DMA1_CH7,DMA_REQUEST_2,DMA1_Channel6,DMA1_Channel7},
{"UART3",(tagUartReg volatile *)USART3_BASE,CN_INT_LINE_USART3,CN_INT_LINE_DMA1_CH3,CN_INT_LINE_DMA1_CH2,DMA_REQUEST_2,DMA1_Channel3,DMA1_Channel2},
{"UART4",(tagUartReg volatile *)UART4_BASE,CN_INT_LINE_UART4,CN_INT_LINE_DMA2_CH5,CN_INT_LINE_DMA2_CH3,DMA_REQUEST_2,DMA2_Channel5,DMA2_Channel3},
{"UART5",(tagUartReg volatile *)UART5_BASE,CN_INT_LINE_UART5,CN_INT_LINE_DMA2_CH2,CN_INT_LINE_DMA2_CH1,DMA_REQUEST_2,DMA2_Channel2,DMA2_Channel1},
{"UART6",(tagUartReg volatile *)LPUART1_BASE,CN_INT_LINE_LPUART1,CN_INT_LINE_DMA2_CH7,CN_INT_LINE_DMA2_CH6,DMA_REQUEST_4,DMA2_Channel7,DMA2_Channel6}
};
// =============================================================================

//#define CFG_UART_SENDBUF_LEN    256
//#define CFG_UART_RECVBUF_LEN  256

static u32 TxByteTime;                    //正常发送一个字节所需要的时间
static UART_HandleTypeDef *PutStrDirectH;       //用于printk发送的串口
static UART_HandleTypeDef *GetCharDirectH;      //用于直接接收的串口
static u32 TxDirectPort;                  //用于printk发送的串口号
static u32 RxDirectPort;                  //用于直接接收的串口号
// =============================================================================

static struct UartGeneralCB *pUartCB[CN_UART_NUM];
static u8* pUartSndBuf[CN_UART_NUM] = {NULL};
static u8* pUartRcvBuf[CN_UART_NUM] = {NULL};
static bool_t sUartDmaUsed[] = {false,false,false,false,false,false};
static bool_t sUartSending[] = {false,false,false,false,false,false};
static u8 sDmaRcvOff[CN_UART_NUM] = {0};

static UART_HandleTypeDef sHuart[CN_UART_NUM];
static UART_HandleTypeDef *phuart[CN_UART_NUM] = {
        &sHuart[0],&sHuart[1],&sHuart[2],&sHuart[3],&sHuart[4],&sHuart[5]};

// =============================================================================
static ptu32_t UART_ISR(ptu32_t IniLine);
__weak void Board_UartHalfDuplexSend(u8 port)
{
    //user added if need out of the file
}
__weak void Board_UartHalfDuplexRecv(u8 port)
{
    //user added if need out of the file
}

static void __UART_StartRecv(u8 port)
{
    if(sUartDmaUsed[port])
    {
        sDmaRcvOff[port] = 0;
        HAL_UART_Receive_DMA(phuart[port],pUartRcvBuf[port],CFG_UART_RECVBUF_LEN);
    }
    else
    {
        HAL_UART_Receive_IT(phuart[port],pUartRcvBuf[port],1);
    }
}


static void __UART_RCC_Enable(u8 port,u8 en)
{
    if(en)
    {
        switch(port)
        {//使能串口1时钟
        case CN_USART1:      __HAL_RCC_USART1_CLK_ENABLE();        break; //使能串口1时钟
        case CN_USART2:      __HAL_RCC_USART2_CLK_ENABLE();        break;
        case CN_USART3:      __HAL_RCC_USART3_CLK_ENABLE();        break;
        case CN_UART4:      __HAL_RCC_UART4_CLK_ENABLE();        break;
        case CN_UART5:      __HAL_RCC_UART5_CLK_ENABLE();        break;
        case CN_LPUART1:      __HAL_RCC_LPUART1_CLK_ENABLE();        break;
        default:
            break;
        }
    }
    else
    {
        switch(port)
        {
        case CN_USART1:      __HAL_RCC_USART1_CLK_DISABLE();        break;
        case CN_USART2:      __HAL_RCC_USART2_CLK_DISABLE();        break;
        case CN_USART3:      __HAL_RCC_USART3_CLK_DISABLE();        break;
        case CN_UART4:      __HAL_RCC_UART4_CLK_DISABLE();        break;
        case CN_UART5:      __HAL_RCC_UART5_CLK_DISABLE();        break;
        case CN_LPUART1:      __HAL_RCC_LPUART1_CLK_DISABLE();        break;
            break;
        default:
            break;
        }
    }
}
// =============================================================================
// 功能: 设置串口baud,PCLK为25M，CPU主频为216M计算,该驱动只提供9600、19200、57600、
//       115200四种波特率设置
// 参数: Reg,被操作的寄存器组指针
//       port,串口号
//       baud,波特率
// 返回: 无
// =============================================================================
static void __UART_BaudSet(u32 port,u32 baud)
{
    if(port < CN_UART_NUM)
    {
        phuart[port]->Init.BaudRate = baud;
        HAL_UART_Abort(phuart[port]);
        UART_SetConfig(phuart[port]);
        __UART_StartRecv(port);
    }
    if(TxDirectPort == port)
    {
        TxByteTime = 11000000/baud;     //1个字节传输时间，按10bit，+10%计算
    }
}

static void __UART_Start(u8 port)
{
    __UART_RCC_Enable(port,1);
    __HAL_UART_ENABLE(phuart[port]);
    __UART_StartRecv(port);
}
static void __UART_Stop(u8 port)
{
    HAL_UART_Abort(phuart[port]);
    __HAL_UART_DISABLE(phuart[port]);
    __UART_RCC_Enable(port,0);
}

// =============================================================================
// 功能: 有关串口参数的初始化，波特率，停止位，奇偶校验位
// 参数：port,串口号
//      data，参数
// 返回: 无
// =============================================================================
static void __UART_ComConfig(tagUartReg volatile *Reg,u32 port,ptu32_t data)
{
    struct COMParam *COM;
    if(port < CN_UART_NUM)
    {
        COM = (struct COMParam *)data;
        phuart[port]->Init.BaudRate = COM->BaudRate;
        switch(COM->Parity)                 // parity
        {
        case CN_UART_PARITY_NONE:   phuart[port]->Init.Parity = UART_PARITY_NONE;break;
        case CN_UART_PARITY_ODD:    phuart[port]->Init.Parity = UART_PARITY_ODD;break;
        case CN_UART_PARITY_EVEN:   phuart[port]->Init.Parity = UART_PARITY_EVEN;break;
        default:break;
        }

        if(COM->Parity == CN_UART_PARITY_NONE)
        {
            switch(COM->DataBits)               // data bits
            {
            case CN_UART_DATABITS_7:    phuart[port]->Init.WordLength = UART_WORDLENGTH_7B;break;
            case CN_UART_DATABITS_8:    phuart[port]->Init.WordLength = UART_WORDLENGTH_8B;break;
            case CN_UART_DATABITS_9:    phuart[port]->Init.WordLength = UART_WORDLENGTH_9B;break;
            default:break;
            }
        }
        else
        {
            switch(COM->DataBits)               // data bits
            {
            case CN_UART_DATABITS_7:    phuart[port]->Init.WordLength = UART_WORDLENGTH_8B;break;
            case CN_UART_DATABITS_8:    phuart[port]->Init.WordLength = UART_WORDLENGTH_9B;break;
            default:break;
            }
        }

