china-djyos/djyos/bsp/cpudrv/stm32/L4/src/uart/cpu_peri_uart.c
        switch(COM->StopBits)               // stop bits
        {
        case CN_UART_STOPBITS_1:    phuart[port]->Init.StopBits = UART_STOPBITS_1;break;
        case CN_UART_STOPBITS_1_5:  phuart[port]->Init.StopBits = UART_STOPBITS_1_5;break;
        case CN_UART_STOPBITS_2:    phuart[port]->Init.StopBits = UART_STOPBITS_2;break;
        default:break;
        }
        HAL_UART_Abort(phuart[port]);
        __HAL_UART_DISABLE(phuart[port]);
        UART_SetConfig(phuart[port]);
        __HAL_UART_ENABLE(phuart[port]);
        __UART_StartRecv(port);
    }
}


// =============================================================================
// 功能: 初始化UART对应的中断线，并初始化中断入口函数
// 参数：SerialNo,串口号
// 返回: 无
// =============================================================================
static void __UART_IntInit(u32 port)
{
    u8 IntLine;

    IntLine = sUartCfg[port].TxRxIntLine;
    Int_Register(IntLine);
    Int_SetClearType(IntLine,CN_INT_CLEAR_AUTO);
    Int_IsrConnect(IntLine,UART_ISR);
    Int_SetIsrPara(IntLine,port);
    Int_SettoAsynSignal(IntLine);
    Int_ClearLine(IntLine);
    Int_RestoreAsynLine(IntLine);
}

// HAL needed
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    u8 port;
    for(port = CN_USART1;port < CN_UART_NUM; port ++)
    {
        if(huart == phuart[port])
            break;
    }
    __UART_RCC_Enable(port,1);
}

// =============================================================================
// 功能: 硬件参数配置和寄存器的初始化，包括波特率、停止位、校验位、数据位，默认情况下:
//       波特率:115200  ； 停止位:1 ; 校验:无 ; 数据位:8bit
// 参数: SerialNo,串口号，0~3
// 返回: 无
// =============================================================================
static void __UART_HardInit(u8 port)
{
    if(port < CN_UART_NUM)
    {
        __UART_RCC_Enable(port,1);
        phuart[port]->Instance = sUartCfg[port].Reg;
        phuart[port]->Init.BaudRate = 115200;
        phuart[port]->Init.WordLength = UART_WORDLENGTH_8B;
        phuart[port]->Init.Parity = UART_PARITY_NONE;
        phuart[port]->Init.StopBits = UART_STOPBITS_1;
        phuart[port]->Init.Mode = UART_MODE_TX_RX;
        phuart[port]->Init.HwFlowCtl = UART_HWCONTROL_NONE;
        phuart[port]->Init.OneBitSampling = UART_ONE_BIT_SAMPLE_ENABLE;
        phuart[port]->Init.OverSampling = UART_OVERSAMPLING_16;
        phuart[port]->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

        HAL_UART_DeInit(phuart[port]);
        HAL_UART_Init(phuart[port]);
        __UART_StartRecv(port);
    }
}

// =============================================================================
// 功能: 启动串口发送，包括两种情况，使用DMA或不使用DMA
// 参数: Reg,被操作的串口寄存器指针.
// 返回: 发送的个数
// =============================================================================
static u32 __UART_SendStart (tagUartReg *Reg,u32 timeout)
{
    u16 port,len=0;
    HAL_StatusTypeDef Ret;

    for(port = CN_USART1;port < CN_UART_NUM;port ++)
    {
        if(Reg == sUartCfg[port].Reg)
            break;
    }
    if(port < CN_UART_NUM)
    {
        if(!sUartSending[port])
        {
            len = UART_PortRead(pUartCB[port],pUartSndBuf[port],CFG_UART_SENDBUF_LEN);
            if(len > 0)
            {
                sUartSending[port] = true;
                if(sUartDmaUsed[port])
                {
                    Ret = HAL_UART_Transmit_DMA(phuart[port],pUartSndBuf[port],len);
                }
                else
                {
                    Ret = HAL_UART_Transmit_IT(phuart[port],pUartSndBuf[port],len);
                }
                if(Ret != HAL_OK)
                    sUartSending[port] = false;
            }
        }
    }

    return len;
}

// =============================================================================
// 功能：配置是否使用DMA传输，
// 参数：port，使用的串口号
//      enable,1 or 0,使能或禁能
// 返回：无
// =============================================================================
void __UART_SetDmaUsed(u8 port,u8 enable)
{
    u8 IntLine;
    if( (false == sUartDmaUsed[port]) && (enable) )
    {
        __HAL_RCC_DMA1_CLK_ENABLE();
        __HAL_RCC_DMA2_CLK_ENABLE();
        HAL_UART_Abort(phuart[port]);

        if(phuart[port]->hdmarx == NULL)
        {
            phuart[port]->hdmarx = (DMA_HandleTypeDef*)malloc(2*sizeof(DMA_HandleTypeDef));
            if(NULL == phuart[port]->hdmarx)
                return;
            phuart[port]->hdmatx = phuart[port]->hdmarx + 1;
        }

        phuart[port]->hdmarx->Instance = sUartCfg[port].DmaRxCh;
        phuart[port]->hdmarx->Init.Direction = DMA_PERIPH_TO_MEMORY;
        phuart[port]->hdmarx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        phuart[port]->hdmarx->Init.MemInc = DMA_MINC_ENABLE;
        phuart[port]->hdmarx->Init.Mode = DMA_CIRCULAR;
        phuart[port]->hdmarx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        phuart[port]->hdmarx->Init.PeriphInc = DMA_PINC_DISABLE;
        phuart[port]->hdmarx->Init.Priority = DMA_PRIORITY_HIGH;
        phuart[port]->hdmarx->Init.Request = sUartCfg[port].DmaReq;
        phuart[port]->hdmarx->XferCpltCallback = 0;
        phuart[port]->hdmarx->XferHalfCpltCallback = 0;
        phuart[port]->hdmarx->XferErrorCallback = 0;
        phuart[port]->hdmarx->Parent = (void*)phuart[port];

        phuart[port]->hdmatx->Instance = sUartCfg[port].DmaTxCh;
        phuart[port]->hdmatx->Init.Direction = DMA_MEMORY_TO_PERIPH;
        phuart[port]->hdmatx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        phuart[port]->hdmatx->Init.MemInc = DMA_MINC_ENABLE;
        phuart[port]->hdmatx->Init.Mode = DMA_NORMAL;
        phuart[port]->hdmatx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        phuart[port]->hdmatx->Init.PeriphInc = DMA_PINC_DISABLE;
        phuart[port]->hdmatx->Init.Priority = DMA_PRIORITY_LOW;
        phuart[port]->hdmatx->Init.Request = sUartCfg[port].DmaReq;
        phuart[port]->hdmatx->XferCpltCallback = 0;
        phuart[port]->hdmatx->XferErrorCallback = 0;
        phuart[port]->hdmatx->XferHalfCpltCallback = 0;
        phuart[port]->hdmatx->Parent = (void*)phuart[port];
        HAL_DMA_Init(phuart[port]->hdmatx);
        HAL_DMA_Init(phuart[port]->hdmarx);

        sUartDmaUsed[port] = true;
        sUartCfg[port].Reg->ICR = USART_ICR_IDLECF; //clear the status flag
        sUartCfg[port].Reg->CR1 |= USART_CR1_IDLEIE;//enable idle int

        IntLine = sUartCfg[port].DmaRxIntLine;
        Int_Register(IntLine);
        Int_SetClearType(IntLine,CN_INT_CLEAR_AUTO);
        Int_IsrConnect(IntLine,(u32(*)(ptu32_t))HAL_DMA_IRQHandler);
        Int_SetIsrPara(IntLine,(ptu32_t)(phuart[port]->hdmarx));
        Int_SettoAsynSignal(IntLine);
        Int_ClearLine(IntLine);
        Int_RestoreAsynLine(IntLine);

        IntLine = sUartCfg[port].DmaTxIntLine;
        Int_Register(IntLine);
        Int_SetClearType(IntLine,CN_INT_CLEAR_AUTO);
        Int_IsrConnect(IntLine,(u32(*)(ptu32_t))HAL_DMA_IRQHandler);
        Int_SetIsrPara(IntLine,(ptu32_t)(phuart[port]->hdmatx));
        Int_SettoAsynSignal(IntLine);
        Int_ClearLine(IntLine);
        Int_RestoreAsynLine(IntLine);
    }
    else if( (sUartDmaUsed[port]) && (!enable) )
    {
        HAL_UART_Abort(phuart[port]);
        free(phuart[port]->hdmarx);
        phuart[port]->hdmarx = NULL;
        phuart[port]->hdmatx = NULL;

        sUartCfg[port].Reg->ICR = USART_ICR_IDLECF;
        sUartCfg[port].Reg->CR1 &= ~USART_CR1_IDLEIE;
        sUartDmaUsed[port] = false;

        IntLine = sUartCfg[port].DmaRxIntLine;
        Int_IsrDisConnect(IntLine);
        Int_ClearLine(IntLine);
        Int_UnRegister(IntLine);

        IntLine = sUartCfg[port].DmaTxIntLine;
        Int_IsrDisConnect(IntLine);
        Int_ClearLine(IntLine);
        Int_UnRegister(IntLine);
    }
    else
    {

