china-djyos/djyos/bsp/cpudrv/stm32/L4/src/uart/cpu_peri_uart.c
// =============================================================================
// 功能：初始化uart1模块,并装载串口设备，会调用uart.c的API函数。该函数主要完成的功能
//       如下：
//       1.初始化串口的硬件部分，如GPIO、中断、配置配置的COM参数，配置baud = 115200
//         stop bits = 1,无奇偶校验, data bits = 8
//       2.调用uart.c的API函数UART_InstallPort，装入串口设备
// 参数：串口号，0~3
// 返回：1=成功，0=失败
// =============================================================================
ptu32_t ModuleInstall_UART(u32 port)
{
    bool_t Ret = false;
    struct UartParam UART_Param;

    if(port < CN_UART_NUM)
    {
        UART_Param.Name         = sUartCfg[port].Name;
        UART_Param.UartPortTag  = (ptu32_t)sUartCfg[port].Reg;
        UART_Param.Baud         = 115200;
        UART_Param.TxRingBufLen = CFG_UART_SENDBUF_LEN;
        UART_Param.RxRingBufLen = CFG_UART_RECVBUF_LEN;
        UART_Param.StartSend    = (UartStartSend)__UART_SendStart;
        UART_Param.UartCtrl     = (UartControl)__UART_Ctrl;

        pUartSndBuf[port] = (u8*)malloc(CFG_UART_SENDBUF_LEN + CFG_UART_RECVBUF_LEN);
        pUartCB[port] = UART_InstallGeneral(&UART_Param);
        if( ( pUartCB[port] != NULL) && (pUartSndBuf[port] != NULL) )
        {
            pUartRcvBuf[port] = pUartSndBuf[port] + CFG_UART_SENDBUF_LEN;
            __UART_HardInit(port);              //硬件初始化
            __UART_IntInit(port);
            Ret = true;
        }
    }
    return Ret;
}

// =============================================================================
// 功能：字符终端直接发送函数，采用轮询方式，直接写寄存器，用于printk，或者stdout
//       没有初始化
// 参数：str，发送字符串指针
//      len，发送的字节数
// 返回：0，发生错误；result,发送数据长度，字节单位
// =============================================================================
s32 Uart_PutStrDirect(const char *str,u32 len)
{
    u32 timeout;
    TxByteTime = 11000000/115200;

    timeout= TxByteTime * len;
    if(HAL_OK != HAL_UART_Transmit(PutStrDirectH,(u8*)str,len,timeout))
    {
        return 0;
    }
    return len;
}

// =============================================================================
// 功能：字符终端直接接收函数，采用轮询方式，直接读寄存器，用于stdin初始化前
// 参数：str，发送字符串指针
//      len，发送的字节数
// 返回：0，发生错误；result,发送数据长度，字节单位
// =============================================================================
char Uart_GetCharDirect(void)
{
    u8 result;
    while(HAL_OK != HAL_UART_Receive(GetCharDirectH,&result,1,0))
    {
        Djy_EventDelay(500);
    }
    return result;
}

//----初始化内核级IO-----------------------------------------------------------
//功能：初始化内核级输入和输出所需的runtime函数指针。
//参数：无
//返回：无
//-----------------------------------------------------------------------------
void Stdio_KnlInOutInit(char * StdioIn, char *StdioOut)
{
    if(!strcmp(StdioOut,"/dev/USART1"))
    {
        TxDirectPort = CN_USART1;
    }
    else if(!strcmp(StdioOut,"/dev/USART2"))
    {
        TxDirectPort = CN_USART2;
    }
    else if(!strcmp(StdioOut,"/dev/USART3"))
    {
        TxDirectPort = CN_USART3;
    }
    else if(!strcmp(StdioOut,"/dev/UART4"))
    {
        TxDirectPort = CN_UART4;
    }
    else if(!strcmp(StdioOut,"/dev/UART5"))
    {
        TxDirectPort = CN_UART5;
    }
    else if(!strcmp(StdioOut,"/dev/UART6"))
    {
        TxDirectPort = CN_LPUART1;
    }
    else
    {
        PutStrDirect = NULL ;
    }

    if(PutStrDirect != NULL)
    {
        PutStrDirectH = phuart[TxDirectPort];
        __UART_HardInit(TxDirectPort);
        TxByteTime = 95;      //初始化默认115200，发送一个byte是87uS,+10%容限
        PutStrDirect = Uart_PutStrDirect;
    }

    if(!strcmp(StdioIn,"/dev/USART1"))
    {
        RxDirectPort = CN_USART1;
    }
    else if(!strcmp(StdioIn,"/dev/USART2"))
    {
        RxDirectPort = CN_USART2;
    }
    else if(!strcmp(StdioIn,"/dev/USART3"))
    {
        RxDirectPort = CN_USART2;
    }
    else if(!strcmp(StdioIn,"/dev/UART4"))
    {
        RxDirectPort = CN_UART4;
    }
    else if(!strcmp(StdioIn,"/dev/UART5"))
    {
        RxDirectPort = CN_UART5;
    }
    else if(!strcmp(StdioIn,"/dev/UART6"))
    {
        RxDirectPort = CN_LPUART1;
    }
    else
    {
        GetCharDirect = NULL ;
    }

    if(GetCharDirect != NULL)
    {
        GetCharDirectH = phuart[RxDirectPort];
        if(TxDirectPort != RxDirectPort)
            __UART_HardInit(RxDirectPort);
        GetCharDirect = Uart_GetCharDirect;
    }
    return;
}
